{
  "basics": {
    "name": "Jose Estronza",
    "label": "Computer Scientist",
    "picture": "https://estronzaj.github.io/images/software-code-300x300.jpg",
    "email": "estronzaj@gmail.com",
    "phone": "",
    "website": "https://estronzaj.github.io",
    "summary": "I am a Computer Scientist who has been with the MedSun program at Food and Drug Administration (FDA) since 2013.  After a period in the U.S. Army performing duties as a Network Systems Operator, I earned a B.S. in Computer Science at the University of Puerto Rico.  My background includes computer science, software development and network security.",
    "location": {
      "address": "",
      "postalCode": "20902",
      "city": "Silver Spring",
      "countryCode": "USA",
      "region": "Maryland"
    },
    "profiles": [
      {
        "network": "github",
        "username": "estronzaj",
        "url": "http://github.com/estronzaj"
      },
      {
        "network": "linkedin",
        "username": "estronzaj",
        "url": "http://linkedin.com/in/estronzaj"
      }
    ]
  },
  "interests": [
    {
      "name": "software engineering",
      "keywords": [
      ]
    },
    {
      "name": "data mining",
      "keywords": [
      ]
    }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "level": "",
      "keywords": [
        "asp.net",
        "C++",
        "JavaScript",
        "Node.js",
        "SQL Server",
        "xml/xslt",
        "vba",
        "vb.net"
      ]
    },
    {
      "name": "Toolsets/OS",
      "level": "",
      "keywords": [
        "MacOS",
        "Ubuntu",
        "Git/GitHub",
        "TortoiseSVN",
        "WCAG 2.0/Section 508",
        "HL7"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Puerto Rico, Bayamon, PR",
      "area": "Computer Science",
      "studyType": "B.S.",
      "startDate": "",
      "endDate": "2009-06-09",
      "gpa": "",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "US Food and Drug Administration",
      "position": "Computer Scientist",
      "website": "https://www.fda.gov",
      "startDate": "2013-07-31",
      "endDate": "Present",
      "summary": "Full stack web developer responsible for end-to-end development for several web applications.",
      "highlights": [
        "Develops and maintains Intranet and External/Extranet Facing web applications",
        "Production Support - identifies and resolves problems in the front-end experienced by the users",
        "Performs code analyses and, in some cases, reverse engineering to determine whether an in­-house developed tool might be improved to meet the needs or new requirements",
        "Develops software enhancements based upon analysis of current and projected needs",
        "Tests pre-release web applications on a 4-stage environment namely: development, test, pre-production and production",
        "Supervises applications testing, review and analysis",
        "Ensures updates are completely tested based on the agreed specifications, standards and functionality required without defects and possible problems",
        "Designs project requirements and participates in project meetings with technical staff members, business analysts, and external stakeholders",
        "Creates and maintains a Change Control Board (CCB) SharePoint web application that is used as a portal for users to request application changes and track application issues",
        "Identifies areas in need of policy changes and provides recommendations proactively",
        "Develops and documents related standard operating procedures, verifying accuracy and usability",
        "Maintains system documentation such as state diagrams, security plans, contingency plans, and validation of users"
      ]
    },
    {
      "company": "Allied Logistics Worldwide",
      "position": "Programmer/Systems Analyst",
      "website": "http://www.alliedpr.com",
      "startDate": "2010-11",
      "endDate": "2013-06",
      "summary": "Responsible for the development of client/network applications using Object Oriented technology, SQL Server 2005 - 2008, Microsoft Access 2003, Visual Studio 2005-2010, and Microsoft Navision.",
      "highlights": [
        "Developed and maintained inventory systems using Microsoft Dynamics NAV (C/AL), MS Access and MS SQL Server",
        "Installed, supported, and maintained server applications and other computer systems, planned for and responded to service outages and other problems",
        "Conducted simple batch programming for ftp uploads, project management for systems-related projects, supervised and trained computer operators, and served as the consultant for computer problems beyond the knowledge of technical support staff",
        "Troubleshoot software, hardware and networking issues over the phone",
        "Answer phone and email responses to the ITS Help Desk"
      ]
    },
    {
      "company": "United States Army Reserve",
      "position": "Sustainment Automation Support Management Office (SASMO)",
      "website": "",
      "startDate": "2010-03",
      "endDate": "2013-03",
      "summary": "Responsible for the installation, validation, and maintenance of Standard Army Management Information System (STAMIS) for the Combat Sustainment Support Battalion and separate units; troubleshoots all STAMIS software and hardware issues.",
      "highlights": [
        "Responsible for the installation, validation, and maintenance of Standard Army Management Information System (STAMIS) for the Battalion and subordinate units",
        "Troubleshot all Standard Army Management Information Systems (STAMIS) software and hardware issues",
        "Ensured all STAMIS systems were on the latest Software Change Package (SCP) / Interim Change Package (ICP)",
        "Added STAMIS systems to the network and ensured that File Transfer Protocol (FTP) were properly configured",
        "Provided support for over 100 Logistical Information Systems (LIS) within the Battalion",
        "Provided training and oversight to section personnel on new equipment fielding",
        "Served as a Systems Administrator for all STAMIS systems and automated logistical programs, providing technical and functional guidance to operators and supervisors",
        "Maintained inventory lists and requisitions supplies, materials and repair parts",
        "Analyzed the quality assurance system and made recommendations for improvements"
      ]
    },
    {
      "company": "Saint Luke’s Home Care and Hospice",
      "position": "Desktop Support Technician",
      "website": "https://www.sanlucaspr.org/hospicio-y-homecare",
      "startDate": "2009-08",
      "endDate": "2010-11",
      "summary": "Analyzed, maintained, troubleshoot and repaired computer systems. Also maintained, upgraded and replaced software and hardware systems.",
      "highlights": [
        "Analyzed, maintained, troubleshot and repaired computer systems",
        "Maintained, upgraded and replaced software and hardware systems, connected computers to the network and set up peripheral equipment, hardware components and allied devices",
        "Loaded software programs/packages and utility applications, installed operating systems, established email accounts, and oversaw upgrades of memory and hard drive systems"
      ]
    },
    {
      "company": "United States Army",
      "position": "Human Resource Supervisor/Military Postal Service Supervisor",
      "website": "",
      "startDate": "1998-08",
      "endDate": "2008-09",
      "summary": "Responsible for a combination of tasks in an APO/JMMT to include accepting and inspecting items for mailing per DoD Postal Manual 4525.6-M, IMM, DMM, ASM, POM, the Postal Operations Division and United States Postal Service and Military Postal Service Agency regulations",
      "highlights": [
        "Supervised and coordinated activities of employees engaged in operating word processing equipment to prepare correspondence, records, reports, and similar items, recommended changes in procedures to affect savings in time, labor, and other cost to improve operation efficiency, evaluated job performance of subordinates and recommended appropriate personnel action",
        "Operated office application suite to compose, type, revise, combine edit, print and store documents, delegating tasks as necessary",
        "Communicated with employees to explain company personnel policies and procedures and answered questions regarding examinations, eligibility, salaries, benefits, and other pertinent information",
        "Responsible for a combination of tasks in an APO/JMMT to include accepting and inspecting items for mailing per DoD Postal Manual 4525.6-M, IMM, DMM, ASM, POM, the Postal Operations Division and United States Postal Service and Military Postal Service Agency regulations",
        "Physically inspected parcels brought by patrons to ensure parcels were 100% free of non-mailable matter, advised customers of postal and custom requirements and determined proper packaging adequacy for acceptance, prepared and affixed routing labels for mail items per the Consolidated Air Massing and Labeling Scheme (CAMALS)",
        "Received incoming mail from military and commercial carriers and compared manifest against mail for proper receipt, provided locator and directory service utilizing the Theater Unit Locator List, redirected and tracked mail transit times using Transit Time Information Standard System for Military Mail (TTISSMM)"
      ]
    }
  ],
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}